/**
 * 神枪手
 * 时间限制： 3000MS
 * 内存限制： 589824KB
 * 题目描述：
 * 小马最近找到了一款打气球的游戏。
 * <p>
 * 每一回合都会有n个气球，每个气球都有对应的分值，第i个气球的分值为ai。
 * <p>
 * 这一回合内，会给小马两发子弹，但是由于小马的枪法不准，一发子弹最多只能打破一个气球，甚至小马可能一个气球都打不中。
 * <p>
 * 现给出小马的得分规则：
 * <p>
 * 1. 若小马一只气球都没打中，记小马得0分。
 * <p>
 * 2. 若小马打中了第i只气球，记小马得ai分。
 * <p>
 * 3. 若小马打中了第i只气球和第j只气球（i＜j），记小马得ai|aj分。
 * <p>
 * （其中 | 代表按位或，按位或的规则如下：
 * <p>
 * 参加运算的两个数，按二进制位进行或运算，只要两个数中的一个为1，结果就为1。
 * <p>
 * 即 0|0=0,1|0=1，1|1=1。
 * <p>
 * 例：2|4即00000010|00000100=00000110，所以2|4=6 ）
 * <p>
 * 现在请你计算所有情况下小马的得分之和。
 * <p>
 * <p>
 * <p>
 * 输入描述
 * 第一行，一个整数n，表示此回合的气球数量。
 * <p>
 * 第二行，用空格分开的n个整数，第i个整数为ai，表示每个气球对应的分值。
 * <p>
 * <p>
 * <p>
 * 1≤n≤50000,1≤ai≤100000
 * <p>
 * 输出描述
 * 一行一个整数，代表所有情况下小马的得分之和。
 * <p>
 * <p>
 * 样例输入
 * 3
 * 1 2 3
 * 样例输出
 * 15
 *
 * @author Deep
 * @create 2022-09-09
 */
public class Main3 {
}
